Revit 2027 API
ControlledApplication.IsLateAddinLoading Property
 Indicates whether this add-in is loaded on the fly or not. If it is loaded when is Revit starting up, it is false, otherwise it should be true.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsLateAddinLoading { get; }
Public ReadOnly Property IsLateAddinLoading As Boolean
	Get
public:
property bool IsLateAddinLoading {
	bool get ();
}
member IsLateAddinLoading : bool with get
Property Value
Boolean
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace